---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.IsToCover
source: html/1d0d12da-826f-cd73-89da-3f6c371331bd.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.IsToCover Method

Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover.'

## Syntax (C#)
```csharp
public bool IsToCover()
```